Tekla Open API Reference for Tekla Structures 2025
DrawingHandler.GetDrawings Method
 Gets all the drawings from the database.
 Namespace: Tekla.Structures.Drawing
 Assembly: Tekla.Structures.Drawing (in Tekla.Structures.Drawing.dll) Version: 2025.0.0-alpha00048669+a99462f17964bc42624ada6e8d316db2d795d226
Syntax
public DrawingEnumerator GetDrawings()
Public Function GetDrawings As DrawingEnumerator
Return Value
Type: DrawingEnumerator
All the drawings from the database.
See Also
Reference
DrawingHandler Class
Tekla.Structures.Drawing Namespace